from app import app, db, Course

courses = [
    {"id": 0, "name": "Python კურსი", "price": 3200, "prof": "დავით ინანაშვილი", "img":"prof1.jpg", "description":"სწავლა იწყება საფუძვლებიდან და გეხმარება ნაბიჯ-ნაბიჯ გადახვიდე პრაქტიკულ ცოდნაზე. კურსი მოიცავს ისეთ თემებს, როგორებიცაა: ცვლადები, პირობითი ოპერატორები, ციკლები, ფუნქციები, ფაილური სისტემასთან მუშაობა და ობიექტზე ორიენტირებული პროგრამირება. დავალებები აგებულია რეალურ მაგალითებზე, ხოლო პროექტები გეხმარება პორტფოლიოს შექმნაში.", "date":"1 აგვისტო - 30 მაისი"},
    {"id": 1, "name": "ვებ-დეველოპმენტის კურსი", "price": 800, "prof": "გიორგი თამარაშვილი", "img":"prof2.jpg", "description":"ეს კურსი გაძლევს საშუალებას შექმნა თანამედროვე, რეაგირებადი ვებსაიტები HTML, CSS და JavaScript-ის გამოყენებით. ნაბიჯ-ნაბიჯ შეისწავლი სტრუქტურირებას, სტილიზაციას და ინტერაქციულ ფუნქციებს. კურსის ბოლოს შეგეძლება შექმნა საკუთარი პორტფოლიოს ვებსაიტი და დაამზადო მცირე პროექტები რეალური დიზაინის მიხედვით." , "date":"3 ივლისი - 30 დეკემბერი"},
    {"id": 2, "name": "ციფრული მარკეტინგის კურსი", "price": 2000, "prof": "ლიკა კიკნაძე", "img":"prof3.jpg", "description":"ეს კურსი გასწავლით როგორ გამოიყენო სოციალური მედია, საძიებო სისტემები და რეკლამა ონლაინ სივრცეში ბიზნესის გასაზრდელად. სწავლობთ SEO-ს, Google Ads-ს, Meta Ads-ს, იმეილ მარკეტინგსა და ანალიტიკას. კურსის ბოლოს შეძლებთ კამპანიების დაგეგმვას, შესრულებას და შედეგების გაზომვას.", "date":"3 აგვისტო - 3 მარტი"},
    {"id": 3, "name": "ინტერიერის დიზაინის კურსი", "price": 900, "prof": "ლადო კერესელიძე", "img":"prof4.jpg", "description":"აღმოაჩინე სივრცის დიზაინის სამყარო! კურსი გასწავლის ფერთა თეორიას, განლაგების წესებს, განათებისა და მასალების შერჩევას. შეისწავლი როგორც ხელით ესკიზების შექმნას, ისე პროგრამებით მუშაობას (AutoCAD, SketchUp). კურსის ბოლოს შეძლებ მოამზადო საკუთარი დიზაინ-პროექტი რეალურ სივრცეზე დაფუძნებით.", "date":"11 ივნისი - 1 იანვარი"},
]

with app.app_context():
    db.create_all()

    for course in courses:
        new_course = Course(name=course["name"], price=course["price"], prof=course["prof"],
                            img=course["img"], description=course["description"], date=course["date"])
        db.session.add(new_course)
    db.session.commit()