from flask.cli import with_appcontext
import click
from src.ext import db
from src.models.course import Course
from src.models.user import User

@click.command("init_db")
@with_appcontext
def init_db():
    click.echo("initializing database...")

    db.drop_all()
    db.create_all()

    click.echo("Initialized database")


@click.command("populate_db")
@with_appcontext
def populate_db():
    courses = [
        {"id": 0, "name": "Python დეველოპმენტი", "price": 3200, "prof": "დავით ინანაშვილი", "img": "prof1.jpg",
         "description": "სწავლა იწყება საფუძვლებიდან და გეხმარება ნაბიჯ-ნაბიჯ გადახვიდე პრაქტიკულ ცოდნაზე. კურსი მოიცავს ისეთ თემებს, როგორებიცაა: ცვლადები, პირობითი ოპერატორები, ციკლები, ფუნქციები, ფაილური სისტემასთან მუშაობა და ობიექტზე ორიენტირებული პროგრამირება. დავალებები აგებულია რეალურ მაგალითებზე, ხოლო პროექტები გეხმარება პორტფოლიოს შექმნაში.",
         "date": "1 აგვისტო - 30 მაისი"},
        {"id": 1, "name": "ვებ-დეველოპმენტი", "price": 800, "prof": "გიორგი თამარაშვილი", "img": "prof2.jpg",
         "description": "ეს კურსი გაძლევს საშუალებას შექმნა თანამედროვე, რეაგირებადი ვებსაიტები HTML, CSS და JavaScript-ის გამოყენებით. ნაბიჯ-ნაბიჯ შეისწავლი სტრუქტურირებას, სტილიზაციას და ინტერაქციულ ფუნქციებს. კურსის ბოლოს შეგეძლება შექმნა საკუთარი პორტფოლიოს ვებსაიტი და დაამზადო მცირე პროექტები რეალური დიზაინის მიხედვით.",
         "date": "3 ივლისი - 30 დეკემბერი"},
        {"id": 2, "name": "ციფრული მარკეტინგი", "price": 2000, "prof": "ლიკა კიკნაძე", "img": "prof3.jpg",
         "description": "ეს კურსი გასწავლით როგორ გამოიყენო სოციალური მედია, საძიებო სისტემები და რეკლამა ონლაინ სივრცეში ბიზნესის გასაზრდელად. სწავლობთ SEO-ს, Google Ads-ს, Meta Ads-ს, იმეილ მარკეტინგსა და ანალიტიკას. კურსის ბოლოს შეძლებთ კამპანიების დაგეგმვას, შესრულებას და შედეგების გაზომვას.",
         "date": "3 აგვისტო - 3 მარტი"},
        {"id": 3, "name": "კიბერუსაფრთხოება", "price": 900, "prof": "ლადო კერესელიძე", "img": "prof4.jpg",
         "description": "აღმოაჩინე სივრცის დიზაინის სამყარო! კურსი გასწავლის ფერთა თეორიას, განლაგების წესებს, განათებისა და მასალების შერჩევას. შეისწავლი როგორც ხელით ესკიზების შექმნას, ისე პროგრამებით მუშაობას (AutoCAD, SketchUp). კურსის ბოლოს შეძლებ მოამზადო საკუთარი დიზაინ-პროექტი რეალურ სივრცეზე დაფუძნებით.",
         "date": "11 ივნისი - 1 იანვარი"},
        {"id": 4, "name": "Back-end დეველოპმენტი", "price": 1500, "prof": "თამარ ჯავახიშვილი",
         "img": "prof5.jpg",
         "description": "Back-end დეველოპმენტის კურსი განკუთვნილია მათთვის, ვინც სურს შეისწავლოს ვებ-აპლიკაციების ფუნდამენტური მხარეები და იმუშაოს სერვერის მხარეს. კურსში დეტალურად განიხილება პროგრამირების ენები, როგორიცაა Python და Node.js, მონაცემთა ბაზები (MySQL, PostgreSQL) და RESTful API-ების შექმნა. მონაწილეები პრაქტიკულად ისწავლიან ავტორიზაციის სისტემების, მონაცემთა შენახვის და სერვერის ლოგიკის აშენებას.",
         "date": "1 აგვისტო - 30 მარტი"},
        {"id": 5, "name": "მონაცემთა მეცნიერება", "price": 1900, "prof": "ნინო გაგნიძე", "img": "prof6.jpg",
         "description": "მონაცემთა მეცნიერების კურსი შესთავაზებს საფუძვლიან ცოდნას მონაცემების ანალიზში და ვიზუალიზაციაში. სტუდენტები ისწავლიან Python-ს, სტატისტიკას და მანქანური სწავლების საწყისებს. კურსი მოიცავს პრაქტიკულ დავალებებს რეალურ მონაცემებზე. მონაწილეები გაეცნობიან ისეთ ინსტრუმენტებს, როგორიცაა Pandas, Matplotlib და Scikit-learn. სწავლის ბოლოს შეძლებენ მონაცემებზე დაყრდნობით გადაწყვეტილებების მიღებას.",
         "date": "1 აგვისტო - 20 იანვარი"},
        {"id": 6, "name": "გრაფიკული დიზაინი UI/UX", "price": 1100, "prof": "გიორგი მიქელაძე", "img": "prof7.jpg",
         "description": "UI/UX დიზაინის კურსი გასწავლის მომხმარებლისთვის კომფორტული ინტერფეისების შექმნას. ისწავლი პროტოტიპირების, ვაირფრეიმინგის, დიზაინის სისტემების შექმნას და პროგრამებთან მუშაობას (Figma, Adobe XD). კურსის ბოლოს შეძლებ შექმნა საკუთარი აპლიკაციის ან ვებსაიტის დიზაინი.",
         "date": "15 ივლისი - 15 იანვარი"},
        {"id": 7, "name": "მონაცემთა ბაზები", "price": 1300, "prof": "მარიამ ქავთარაძე", "img": "prof8.jpg",
         "description": "მონაცემთა ბაზების კურსი გასწავლის SQL-ის საფუძვლებს და მუშაობას რელაციურ (MySQL, PostgreSQL) და არარელაციურ (MongoDB) ბაზებთან. ისწავლი მონაცემთა მოდელირებას, ნორმალიზაციას, JOIN ოპერაციებს და სიჩქარის ოპტიმიზაციას. კურსის ბოლოს შეძლებ შექმნა და მართო საკუთარი მონაცემთა ბაზის სისტემა.",
         "date": "5 ოქტომბერი - 5 აპრილი"}
    ]

    for course in courses:
        new_course = Course(name=course["name"], price=course["price"], prof=course["prof"],
                            img=course["img"], description=course["description"], date=course["date"])
        db.session.add(new_course)
    db.session.commit()

    ### ADMIN USER ###
    User(username="admin", email="admin@gmail.com", password="password123", profile_img="admin.png", role="Admin").create()
